c/axis2c/guththila/tests/resources/soap/soapmessage1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
    <soapenv:Header>
        <wsa:MessageID soapenv:mustUnderstand="0">
            uuid:920C5190-0B8F-11D9-8CED-F22EDEEBF7E5</wsa:MessageID>
        <wsa:To soapenv:mustUnderstand="0">
            http://localhost:8081/axis/services/BankPort</wsa:To>
        <wsa:From soapenv:mustUnderstand="0">
            <Address xmlns="http://schemas.xmlsoap.org/ws/2004/03/addressing">
                http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous
            </Address>
        </wsa:From>
    </soapenv:Header>
    <soapenv:Body>
        <ns1:getBalance soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
            xmlns:ns1="http://localhost:8081/axis/services/BankPort">
            <ns1:accountNo href="#id0"/>
        </ns1:getBalance>
        <multiRef xmlns="tempUri" id="id0" soapenc:root="0"
            soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
            xsi:type="xsd:int"
            xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">1001
        </multiRef>
    </soapenv:Body>
</soapenv:Envelope>